this.inherits(SKILL);
this.name = "青蝠身法";
this.id = "qingfushenfa";
this.grade = 2;

this.dodge_actions = [
	"只见$n一招「福满乾坤」，身形陡然纵起，躲过了$N这一招。",
	"$n一式「五蝠献寿」，身形晃动，向一旁飘出，避开了$N这一招。。",
	"$n使出「洞天福地」，一个空心筋斗向后翻出，避开了$N的凌厉攻势。",
	"$n一招「云龙百蝠」，身随意转，$N只觉眼前一花，$n已绕至$N的身后。",
	"$n施展「蝠翔天际」，身形如蝙蝠般无声无息地滑翔而出，$N的攻击只击中一片残影。",
	"只见$n「暗夜蝠影」，身形一矮，贴地疾掠，在黑暗中如鬼魅般飘忽不定，$N根本无法锁定。",
	"$n忽地一式「倒悬金钟」，身形凌空倒翻，头下脚上地盘旋而过，$N的招式从身侧擦过。",
	"$n施展「蝠翼天翔」，双臂一振，身形如青蝠展翅般向斜上方掠出，$N的攻击尽数落空。",
	"但见$n「鬼蝠迷踪」，身法诡谲莫测，忽左忽右，$N眼前尽是其飘忽的残影。",
	"$n一式「青蝠掠影」，身形疾如闪电，在$N身边一掠而过，只留下一道青影，$N攻击落空。",
];
this.desc = "明教青翼蝠王成名绝技";
//"(\w+)"(.+?)"NOR"
//<$1>$2</$1>
this.can_enables = ["dodge"];
this.learn_condition = {
	max_mp: 2000,
	skill: { dodge: 200 }
	};

this.query_enable_prop = function (lv) {
	return {
				dodge: {
					ds: parseInt(lv * 1.9) + 0,
					dex: parseInt(lv * 100.0 / 1000),
				},
			}
		};
